In [1]:
import pandas as pd

In [8]:
df = pd.read_csv(r"C:\Users\Archa\Downloads\HR Employee Attrition.csv")

In [9]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [10]:
import re

def to_snake_case(col):
    col = re.sub('(.)([A-Z][a-z]+)', r'\1_\2', col)
    col = re.sub('([a-z0-9])([A-Z])', r'\1_\2', col)
    return col.lower()

df.columns = [to_snake_case(c) for c in df.columns]

In [11]:
df.columns

Index(['age', 'attrition', 'business_travel', 'daily_rate', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_count',
       'employee_number', 'environment_satisfaction', 'gender', 'hourly_rate',
       'job_involvement', 'job_level', 'job_role', 'job_satisfaction',
       'marital_status', 'monthly_income', 'monthly_rate',
       'num_companies_worked', 'over18', 'over_time', 'percent_salary_hike',
       'performance_rating', 'relationship_satisfaction', 'standard_hours',
       'stock_option_level', 'total_working_years', 'training_times_last_year',
       'work_life_balance', 'years_at_company', 'years_in_current_role',
       'years_since_last_promotion', 'years_with_curr_manager'],
      dtype='object')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   age                         1470 non-null   int64
 1   attrition                   1470 non-null   object
 2   business_travel             1470 non-null   object
 3   daily_rate                  1470 non-null   int64
 4   department                  1470 non-null   object
 5   distance_from_home          1470 non-null   int64
 6   education                   1470 non-null   int64
 7   education_field             1470 non-null   object
 8   employee_count              1470 non-null   int64
 9   employee_number             1470 non-null   int64
 10  environment_satisfaction    1470 non-null   int64
 11  gender                      1470 non-null   object
 12  hourly_rate                 1470 non-null   int64
 13  job_involvement             1470 non-null   int64
 14  job_level                   1470 non-null   int64
 15  job_role                    1470 non-null   object
 16  job_satisfaction            1470 non-null   int64
 17  marital_status              1470 non-null   object
 18  monthly_income              1470 non-null   int64
 19  monthly_rate                1470 non-null   int64
 20  num_companies_worked        1470 non-null   int64
 21  over18                      1470 non-null   object
 22  over_time                   1470 non-null   object
 23  percent_salary_hike         1470 non-null   int64
 24  performance_rating          1470 non-null   int64
 25  relationship_satisfaction   1470 non-null   int64
 26  standard_hours              1470 non-null   int64
 27  stock_option_level          1470 non-null   int64
 28  total_working_years         1470 non-null   int64
 29  training_times_last_year    1470 non-null   int64
 30  work_life_balance           1470 non-null   int64
 31  years_at_company            1470 non-null   int64
 32  years_in_current_role       1470 non-null   int64
 33  years_since_last_promotion  1470 non-null   int64
 34  years_with_curr_manager     1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [13]:
drop_cols=['daily_rate','employee_count','hourly_rate','monthly_rate','over18','standard_hours']
df=df.drop(columns=drop_cols)

In [14]:
df.columns

Index(['age', 'attrition', 'business_travel', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_number',
       'environment_satisfaction', 'gender', 'job_involvement', 'job_level',
       'job_role', 'job_satisfaction', 'marital_status', 'monthly_income',
       'num_companies_worked', 'over_time', 'percent_salary_hike',
       'performance_rating', 'relationship_satisfaction', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'work_life_balance',
       'years_at_company', 'years_in_current_role',
       'years_since_last_promotion', 'years_with_curr_manager'],
      dtype='object')

In [15]:
df=df.rename(columns={'employee_number' : 'employee_id'})

In [16]:
df.columns

Index(['age', 'attrition', 'business_travel', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_id',
       'environment_satisfaction', 'gender', 'job_involvement', 'job_level',
       'job_role', 'job_satisfaction', 'marital_status', 'monthly_income',
       'num_companies_worked', 'over_time', 'percent_salary_hike',
       'performance_rating', 'relationship_satisfaction', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'work_life_balance',
       'years_at_company', 'years_in_current_role',
       'years_since_last_promotion', 'years_with_curr_manager'],
      dtype='object')

In [17]:
df['attrition'] = df['attrition'].map({'Yes': 1, 'No': 0})

In [18]:
df['attrition'].value_counts(normalize=True) * 100

attrition
0    83.877551
1    16.122449
Name: proportion, dtype: float64

In [19]:
df['over_time'] = df['over_time'].map({'Yes': 1, 'No': 0})

In [20]:
df['gender'] = df['gender'].map({'Male': 1, 'Female': 0})

In [21]:
df.head()

,age,attrition,business_travel,department,distance_from_home,education,education_field,employee_id,environment_satisfaction,gender,...,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager
0,41,1,Travel_Rarely,Sales,1,2,Life Sciences,1,2,0,...,3,1,0,8,0,1,6,4,0,5
1,49,0,Travel_Frequently,Research & Development,8,1,Life Sciences,2,3,1,...,4,4,1,10,3,3,10,7,1,7
2,37,1,Travel_Rarely,Research & Development,2,2,Other,4,4,1,...,3,2,0,7,3,3,0,0,0,0
3,33,0,Travel_Frequently,Research & Development,3,4,Life Sciences,5,4,0,...,3,3,0,8,3,3,8,7,3,0
4,27,0,Travel_Rarely,Research & Development,2,1,Medical,7,1,1,...,3,4,1,6,3,3,2,2,2,2

In [22]:
df.describe(include='all')

,age,attrition,business_travel,department,distance_from_home,education,education_field,employee_id,environment_satisfaction,gender,...,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager
count,1470.000000,1470.000000,1470,1470,1470.000000,1470.000000,1470,1470.000000,1470.000000,1470.000000,...,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000
unique,NaN,NaN,3,3,NaN,NaN,6,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,NaN,Travel_Rarely,Research & Development,NaN,NaN,Life Sciences,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,NaN,1043,961,NaN,NaN,606,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,36.923810,0.161224,NaN,NaN,9.192517,2.912925,NaN,1024.865306,2.721769,0.600000,...,3.153741,2.712245,0.793878,11.279592,2.799320,2.761224,7.008163,4.229252,2.187755,4.123129
std,9.135373,0.367863,NaN,NaN,8.106864,1.024165,NaN,602.024335,1.093082,0.490065,...,0.360824,1.081209,0.852077,7.780782,1.289271,0.706476,6.126525,3.623137,3.222430,3.568136
min,18.000000,0.000000,NaN,NaN,1.000000,1.000000,NaN,1.000000,1.000000,0.000000,...,3.000000,1.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,30.000000,0.000000,NaN,NaN,2.000000,2.000000,NaN,491.250000,2.000000,0.000000,...,3.000000,2.000000,0.000000,6.000000,2.000000,2.000000,3.000000,2.000000,0.000000,2.000000
50%,36.000000,0.000000,NaN,NaN,7.000000,3.000000,NaN,1020.500000,3.000000,1.000000,...,3.000000,3.000000,1.000000,10.000000,3.000000,3.000000,5.000000,3.000000,1.000000,3.000000
75%,43.000000,0.000000,NaN,NaN,14.000000,4.000000,NaN,1555.750000,4.000000,1.000000,...,3.000000,4.000000,1.000000,15.000000,3.000000,3.000000,9.000000,7.000000,3.000000,7.000000
max,60.000000,1.000000,NaN,NaN,29.000000,5.000000,NaN,2068.000000,4.000000,1.000000,...,4.000000,4.000000,3.000000,40.000000,6.000000,4.000000,40.000000,18.000000,15.000000,17.000000

In [23]:
# create category for working yrs
def tenurebucket(years):
    if years <= 2:
        return '0-2'
    elif years <= 5:
        return '3-5'
    elif years <= 10:
        return '6-10'
    else:
        return '10+'

df['tenure_bucket'] = df['years_at_company'].apply(tenurebucket)

In [24]:
#create label for salary
df['income_level'] = pd.qcut(
    df['monthly_income'],
    q=3,
    labels=['Low', 'Medium', 'High']
)

In [25]:
df['promotion_gap'] = df['years_at_company'] - df['years_since_last_promotion']

In [26]:
df[['years_at_company','years_since_last_promotion','promotion_gap','income_level','tenure_bucket']].head()

,years_at_company,years_since_last_promotion,promotion_gap,income_level,tenure_bucket
0,6,0,6,Medium,6-10
1,10,1,9,Medium,6-10
2,0,0,0,Low,0-2
3,8,3,5,Low,6-10
4,2,2,0,Low,0-2

In [27]:
df['work_life_risk']=((df['over_time']==1) & (df['work_life_balance']<=2)).astype(int)

In [28]:
df[['income_level','tenure_bucket','work_life_risk']].head()

  income_level tenure_bucket  work_life_risk
0       Medium          6-10               1
1       Medium          6-10               0
2          Low           0-2               0
3          Low          6-10               0
4          Low           0-2               0

In [29]:
tenure_attrition = ((
    df.groupby('tenure_bucket')['attrition']
      .mean() * 100).round(2)
      .sort_values(ascending=False)
)

tenure_attrition

tenure_bucket
0-2     29.82
3-5     13.82
6-10    12.28
10+      8.13
Name: attrition, dtype: float64

In [30]:
income_attrition = ((
    df.groupby('income_level')['attrition']
      .mean() * 100).round(2)
      .sort_values(ascending=False)
)

income_attrition

C:\Users\Archa\AppData\Local\Temp\ipykernel_7684\3691094755.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('income_level')['attrition']

income_level
Low       26.12
Medium    11.63
High      10.61
Name: attrition, dtype: float64

In [31]:
(df.groupby('over_time')['attrition'].mean() *100).round(2)

over_time
0    10.44
1    30.53
Name: attrition, dtype: float64

In [32]:
(df.groupby(pd.cut(df['promotion_gap'], bins=[0,2,5,10,40]))['attrition'].mean() *100).round(2)

C:\Users\Archa\AppData\Local\Temp\ipykernel_7684\2999709850.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  (df.groupby(pd.cut(df['promotion_gap'], bins=[0,2,5,10,40]))['attrition'].mean() *100).round(2)

promotion_gap
(0, 2]      22.51
(2, 5]      14.48
(5, 10]      8.68
(10, 40]     6.84
Name: attrition, dtype: float64

In [37]:
import pandas as pd
from sqlalchemy import create_engine
username = "root"          # change ONLY if different
password = "root" # put the REAL password
host = "localhost"
port = "3306"
database = "hr_attrition"  # must already exist

engine = create_engine(
    f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}"
)

In [38]:
with engine.connect() as conn:
    print("MySQL connected successfully")

MySQL connected successfully

In [39]:
df.to_sql("employees", engine, if_exists="replace", index=False)

1470